[
  {
    "courseCode": "SC1008",
    "au": 3,
    "title": "C and C++ Programming",
    "description": "TBC",
    "intendedLearningOutcomes": [],
    "semesters": [2],
    "prerequisites": [["SC1003"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC1003",
    "au": 3,
    "title": "Introduction to Computational Thinking and Programming",
    "description": "Computational thinking (CT) is the process of analyzing a problem then designing and expressing its solution in such a way that a computer can effectively carry it out. This course aims to take students with no prior experience of thinking in a computational manner to a point where they can derive simple algorithms and code programs to solve basic problems in their domain of studies. Topics also include basic program constructs, simple data structures, and an appreciation of the internal operations of a processor.",
    "intendedLearningOutcomes": [
      "Describe the internal operation of a basic processor, how a program is executed by a computer and computing trends.",
      "Analyze a problem then design and express its solution in such a way that a computer can effectively carry it out (i.e., equip you with CT skills).",
      "Implement problem solutions as programs using basic control structures (sequence, conditional, iterative).",
      "Implement problem solutions as programs using basic data types and aggregate data types.",
      "Apply the CT concepts on case studies/problem-based scenarios through hands-on practice of the CT processes."
    ],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC1004",
    "au": 3,
    "title": "Linear Algebra for Computing",
    "description": "This course aims to support you to learn mathematical concepts related to linear algebra. You will develop set of mathematical skills for applications in computer science and engineering, e.g., machine learning, computer graphics, data science etc.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["SC1003"], ["MH1810"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC1005",
    "au": 3,
    "title": "Digital Logic",
    "description": "This course aims to develop your ability to analyse and design digital circuits. The design and behaviour of modern digital equipment (e.g. mobile phones and personal computers) are based on functions of binary variables. This course provides you the knowledge to analyse the theoretical characteristics and the skills required for practical technology-driven implementations of digital circuits. This course provides an introductory perspective of digital circuits design. It is relevant for anyone pursuing a career in the ICT industry – including those in digital systems, computer architecture and microprocessor based systems design.",
    "intendedLearningOutcomes": [
      "Represent integers in binary.",
      "Recognise and use elementary logic operators.",
      "Analyse a given Boolean expression and optimize it for efficient implementation.",
      "Design and implement simple combinational and sequential circuits.",
      "Use Verilog to design hardware systems based on the above principles."
    ],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC1006",
    "au": 3,
    "title": "Computer Organisation and Architecture",
    "description": "Computer Hardware Decomposition; Solid-state memory subsystems; Magnetic memory; Input/Output techniques; The central processor unit; How high level code is `executed?; Quantifying and comparing performance; Computer arithmetic; Towards higher speed.",
    "intendedLearningOutcomes": [
      "Describe and analyse the basic factors influencing computer organization and performance.",
      "Describe the basic operation of the CPU and how programs are executed on a computer",
      "Describe and explain how high-level programming constructs are implemented with low-level instructions",
      "Describe, analyse and evaluate the characteristics of different memory subsystems",
      "Describe and analyse basic input/output techniques",
      "Describe and evaluate the different number representations and basic arithmetic operations."
    ],
    "semesters": [1, 2],
    "prerequisites": [["SC1005"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC1007",
    "au": 3,
    "title": "Data Structures",
    "description": "This course aims to (i) teach the concepts, implementations and applications of data structures such as arrays, linked lists, stacks, queues and trees that are important for building efficient algorithms; (ii) provide an introduction to algorithm analysis and design. These are essential for future computer science and computer engineering courses.",
    "intendedLearningOutcomes": [
      "Design and implement simple C programs using basic programming constructs.",
      "Design and implement pointers, arrays, character strings and structures in C.",
      "Design and implement recursive functions in C.",
      "Design and implement dynamic memory allocation in C.",
      "Design and implement linked lists, stacks and queues in C.",
      "Design and implement tree structures in C."
    ],
    "semesters": [1, 2],
    "prerequisites": [["SC1003"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC1013",
    "au": 2,
    "title": "Physics for Computing",
    "description": "Course Content Optics, Electrics, Electronics, and Magnetism. Learning Outcome Upon completion of the course, students should be able to: a. Explain basic knowledge of all the selected topics b. Identify the contribution of physics in some computing systems c. Realize and appreciate the interdisciplinary nature of many innovative systems d. Self-reflect whether you are more aware of the importance of Physics and more sensitive to the progress of physics, and consider to propose novel physics-computing systems",
    "intendedLearningOutcomes": [
      "Explain basic knowledge (definitions, principles and techniques) of all the selected topics.",
      "Identify the contribution of physics in some computing systems.",
      "Discuss the interdisciplinary nature of many innovative systems.",
      "Reflect the importance and the recent progress of Physics, to prepare to propose novel physics-computing systems in the future."
    ],
    "semesters": [1],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC1015",
    "au": 3,
    "title": "Introduction to Data Science & Artificial Intelligence",
    "description": "This course will start with the core principles of Data Science, and will equip you with the basic tool and techniques of data handling, exploratory data analysis, data visualization, data-based inference, and data-focussed communication. The course will also introduce you to the fundamentals of Artificial Intelligence - state space representation, uninformed search, and reinforcement learning. The course will motivate you to work closely with data and make data-driven decisions in your field of study. The course will also touch upon ethical issues in Data Science and Artificial Intelligence, and motivate you to explore the cutting-edge applications related to Big Data, Neural Networks and Deep Learning. Python will be the language of choice to introduce hands-on computational techniques.",
    "intendedLearningOutcomes": [],
    "semesters": [2],
    "prerequisites": [["SC1003"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC2000",
    "au": 3,
    "title": "Probability & Statistics for Computing",
    "description": "This course aims to develop your foundation in engineering mathematics, particularly in probability and statistics. This course provides the basic engineering mathematics foundation that is necessary for anyone pursuing a computer science and engineering degree course.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["MH1810"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },

  {
    "courseCode": "SC2001",
    "au": 3,
    "title": "Algorithms",
    "description": "Overview of Database Management Systems (DBMS); Entity-Relationship Data Model; Relational Data Model; Functional Dependencies (FD) and Normalization; Relational Algebra; Structured Query Language (SQL); Storage of Relational Data; Indexing Techniques; Query Processing and Optimization; Transaction Management and Concurrency Control",
    "intendedLearningOutcomes": [
      "Conduct complexity analysis of basic algorithms.",
      "Design and analyse algorithms using suitable strategies (e.g. incremental, divide and conquer, data-structure, and greedy approaches) to solve problems.",
      "Compare the efficiencies of different algorithms for the same problem (e.g. searching, sorting or graph traversal).",
      "Describe various heuristic problem-solving methods.",
      "Implement algorithms from pseudo code into real code."
    ],
    "semesters": [1, 2],
    "prerequisites": [["MH1812"], ["SC1007"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC2002",
    "au": 3,
    "title": "Object Oriented Design & Programming",
    "description": "The object-oriented paradigm to the design of software is one major successful approach to address complexity and maintainability issues in software systems. We want students to establish an object-oriented mindset and to gain valuable insights into how software can be developed using the object-oriented approach. This course should not be interpreted to be a pure programming language course. Rather, the programming language serves to illustrate, via practical examples, the concepts learnt in the course. As a student of this course, you will learn essential object-oriented concepts such as encapsulation, the separation of design from implementation, the use of inheritance and polymorphism. Finally, you will also learn good design principles for reuse, and to realise these principles using object-oriented programming languages such as Java and/or C++.",
    "intendedLearningOutcomes": [
      "Explain the concepts of object-oriented methodology and demonstrate it in developing software programs.",
      "Design simple software programs using good design principles with consideration for reuse and maintainability, to solve problems.",
      "Implement a given design in Java and/or C++."
    ],
    "semesters": [1, 2],
    "prerequisites": [["SC1003", "SC1007"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC2005",
    "au": 3,
    "title": "Operating Systems",
    "description": "This course aims to develop your understanding of fundamental concepts and principles of modern operating systems, and to build your knowledge on the design and implementation of main operating system components.",
    "intendedLearningOutcomes": [
      "Explain fundamental concepts and principles of modern operating systems",
      "Identify the functions and services provided by each component of an operating system",
      "Describe how processes, memory, files, and I/O devices are managed in an operating system",
      "Analyze and evaluate algorithms that implement core functions of major operating system components",
      "Implement functions for operating system components in accordance to design requirements using the concepts and principles learnt in this course"
    ],
    "semesters": [1, 2],
    "prerequisites": [["SC1006"], ["SC1007"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 2
  },
  {
    "courseCode": "SC2006",
    "au": 3,
    "title": "Software Engineering",
    "description": "This course aims to equip School of Computer Science and Engineering students with foundation knowledge on issues and techniques required for the design and implementation of quality software.",
    "intendedLearningOutcomes": [
      "Participate in all stages of the Software Development Life Cycle for a medium-size software project to deliver the required work products",
      "Elicit and specify requirements clearly and correctly",
      "Use good software design concepts and considerations",
      "Design and carry out test activities to verify that requirements have been met",
      "Perform simple project management of a medium-size software project"
    ],
    "semesters": [1, 2],
    "prerequisites": [["SC2002"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 2
  },
  {
    "courseCode": "SC2207",
    "au": 3,
    "title": "Introduction to Databases",
    "description": "Overview of Database Management Systems (DBMS); Entity-Relationship Data Model; Relational Data Model; Functional Dependencies (FD) and Normalization; Relational Algebra; Structured Query Language (SQL); Storage of Relational Data; Indexing Techniques; Query Processing and Optimization; Transaction Management and Concurrency Control",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["SC2001", "MH1403"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC2008",
    "au": 3,
    "title": "Computer Network",
    "description": "This course serves as a foundation for computer and communication networks. Emphasis is placed on concepts, protocols and technologies, which formulate various Local Area Networks (LANs), Wide area Networks (WANs), and their interconnections. Emphasis is also placed on the fundamentals of the Internet, and includes laboratory sessions on socket programming. Advanced materials, such as, cloud computing, will also be covered to prepare you well for your future career.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["SC2000"], ["SC1004"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC3000",
    "au": 3,
    "title": "Artificial Intelligence",
    "description": "Computer / software engineers are involved in effective and efficient building of knowledge agent systems that satisfy the requirements of users; possibly software for intelligent embedded and intelligent information systems. General awareness of theory, knowledge, and practice in all phases of the knowledge based systems and representation techniques for problem solving are necessary for those of you who wants to get into the field artificial intelligence. These are advanced intelligent systems that are finding widespread applications in finance, banking, manufacturing industries.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["SC1007"], ["SC1015"], ["SC2000", "MH2500"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC4061",
    "au": 3,
    "title": "Computer Vision",
    "description": "TImage formation and segmentation. Image acquisition. Image representations and organisations. Digital image characterisation. Image enhancement and restoration. Image coding and data compression. Geometry for 3D vision. Pattern recognition using neural networks. Image analysis and understanding. Machine vision applications.",
    "intendedLearningOutcomes": [
      "Describe the fundamental computer vision concepts.",
      "Explain the advantages and disadvantages of the common computer vision techniques.",
      "Implement the basic computer vision algorithms.",
      "Apply computer vision techniques to solve simple real problems."
    ],
    "semesters": [1],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4010",
    "au": 3,
    "title": "Applied Cryptography",
    "description": "Cryptography is the foundational building block of Cybersecurity and Privacy. While the field of classical cryptography dealt with security and privacy of data in transit, the modern take on the subject has generalized the scope of its applications to ensuring security and privacy of all forms of digital communication, computation, automation, interaction, transaction and preservation. Thus, it is important to understand the technical aspects of cryptography to appreciate its applications in cybersecurity. The Aim: This cryptography course in Computer Science and Engineering aims to develop your ability to understand how cryptographic algorithms work, to identify the problems associated with the application of cryptography in real-world scenarios, and explain the operation of various cryptographic mechanisms. This course will equip you to know deeply the fundamentals of symmetric key ciphers, hash functions and public key ciphers, enabling you to understand and develop secure cryptography solutions in real life cryptography. It will also introduce you to popular cryptographic libraries and APIs for hands-on implementation of security mechanisms, and some prominent cryptographic standards, guidelines and frameworks from the industry and government bodies.",
    "intendedLearningOutcomes": [
      "Explain and analyse the design and construction of fundamental cryptographic algorithms.",
      "Discuss and explain the construction of cryptographic mechanisms based on the algorithms.",
      "Design and develop basic security applications using open cryptographic libraries and APIs.",
      "Analyse and argue the applicability of cryptographic schemes in certain real-world systems.",
      "Examine and describe the importance of cryptographic standards, guidelines and frameworks in practice."
    ],
    "semesters": [1],
    "prerequisites": [["SC2000", "MH2500"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4040",
    "au": 3,
    "title": "Advanced Topics in Algorithms",
    "description": "This course aims to develop your ability to identify key structural components in algorithms, problems and domains alike, and to exploit them to create provably computationally efficient solutions. This course builds on basic skills obtained in the pre-requisite 'Algorithm Design and Analysis' course to provide you with intricate, elegant and actionable algorithmic design patterns; and develop your skill in exploiting salient problem features to facilitate computation. Algorithms and designs presented in this course were at the beginning of multiple disciplines that now dominate the IT industry, and serve as a stepping stone for your further development for such roles as an algorithms engineer/developer or an applied researcher in computer technologies.",
    "intendedLearningOutcomes": [
      "Analyse, classify and compare algorithms and problems from the computational effort point of view.",
      "Exploit recurring, dynamic and geometric problem structures to facilitate computation.",
      "Recognise limitations of exact computational methods, and exploit the benefits of error tolerance."
    ],
    "semesters": [1],
    "prerequisites": [["SC2001"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4030",
    "au": 3,
    "title": "Wireless and Mobile Networks",
    "description": "This course builds upon the foundation network knowledge gained from core courses on Computer Networks (CE3005/CZ3006/SC2008). It aims to introduce students to the realm of mobile networks and communications made possible through wireless technologies. It provides a straightforward and broad survey of wireless voice and data network standards and technologies available today for personal communications. It is designed for those taking an entry-level wireless and mobile technology course or seeking better knowledge of wireless communications and networks. The topics include the technologies being harnessed in Bluetooth and Bluetooth Low Energy to Wifi to cellular telephony and mobile data to 5G wireless technologies to satellite internet and satellite communications. The course content thus spans wireless personal networks (WPAN), wireless local area networks (WLAN) and wireless wide area networks (WWAN).",
    "intendedLearningOutcomes": [
      "Describe, explain and evaluate the fundamental components and technologies of wireless mobile communication systems.",
      "Describe, explain, discuss and analyse the requirements of, as well as issues and challenges on mobile communication systems.",
      "Describe, explain, discuss and analyse the effects of mobility on the communication system and how the impacts and impairments can be alleviated and resolved.",
      "Factor, analyse and evaluate the various issues, techniques and technologies in the design and development of mobile applications and communication networks."
    ],
    "semesters": [1],
    "prerequisites": [["SC2008"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC3030",
    "au": 3,
    "title": "Advanced Computer Networks",
    "description": "Building upon earlier courses (SC2008), this subject aims to bring students into the realm of real inter-networking. The subject consists of two complementary components. On one hand, several application layer protocols are to be explained, along with their requirements on the underlying networks. One the other hand, practical network design and management methodologies will be introduced; they aim at meeting the application requirements. Emphasis is mostly placed on the practical use and construction of networks, with a bias toward multimedia applications. Advanced materials, such as, peer-to-peer networking will also be covered to prepare the students well for the future career in advanced computer networks.",
    "intendedLearningOutcomes": [
      "Identify and explain several application layer protocols and what they may demand from the underlying networks.",
      "Identify and explain networks design and management to satisfy various application requirements.",
      "Conduct quick protocol performance analysis and making critical design decisions.",
      "Design a network to support a given set of requirements.",
      "Review new technologies and perform literature review related to advanced and emerging computer network technologies."
    ],
    "semesters": [1],
    "prerequisites": [["SC2008"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC3020",
    "au": 3,
    "title": "Database System Principles",
    "description": "Database management systems (DBMS) are designed to manage large and complex data sets. The fundamentals of the implementation of database management systems must be understood by all Computer Science students. This will help students to develop and design software systems utilizing databases, and equip students with the knowledge of managing data of large scale. Moreover, this should be understood by current and future business leaders so that they can offer strategic guidance based on an informed understanding of database business capabilities. This course provides the basis for achieving this goal.",
    "intendedLearningOutcomes": [
      "Discuss the importance of, and uses for, databases within organisations.",
      "Explain how a relational database is implemented.",
      "Describe the principles behind commercial databases and how to manage a relational database system.",
      "Communicate knowledgeably about data management using professional language."
    ],
    "semesters": [1, 2],
    "prerequisites": [["SC2207"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4020",
    "au": 3,
    "title": "Data Analytics and Mining",
    "description": "This course introduces concepts and techniques in data analytics and mining. Topics include data pre-processing, major data mining tasks (classification, clustering, association rule mining), and application of data mining techniques to big data.",
    "intendedLearningOutcomes": [
      "Discuss basic concepts and general knowledge of data analytics, data mining and the KDD process, using professional language associated with data analytics and data mining.",
      "Pre-process the data so that it can be analysed further using sophisticated data analytics and mining algorithms.",
      "Discuss several major data mining tasks (including classification, clustering, and association rule mining, etc) and related algorithms to solve them.",
      "Apply data mining techniques to tackle real-world big data applications, to perform core data analytics & mining tasks with large amount of data."
    ],
    "semesters": [1],
    "prerequisites": [["SC2001", "MH1403"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4000",
    "au": 3,
    "title": "Machine Learning",
    "description": "This course introduces basic concepts and methodologies for machine learning as well as their applications. Clustering. Dimension Reduction. Classification. Decision Theory. Density Estimation. Classifier Evaluation.",
    "intendedLearningOutcomes": [
      "Explain the motivations and principles behind various machine learning algorithms.",
      "Apply or even design specific machine learning algorithms to solve real-world application problems.",
      "Identify some state-of-the-art machine learning techniques.",
      "Conduct research on machine learning."
    ],
    "semesters": [1, 2],
    "prerequisites": [["SC1004"], ["SC1007"], ["SC2000"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4001",
    "au": 3,
    "title": "Neural Network and Deep Learning",
    "description": "This course aims to provide you with a basic but comprehensive foundation of neural networks and deep learning, including underlying principles, architectures, and learning algorithms of various types of deep neural networks that are essential for future applications of artificial intelligence and data science.",
    "intendedLearningOutcomes": [
      "Interpret artificial neuron as an abstraction of biological neuron and explain how it can be used to build deep neural networks that are trained to perform various tasks such as regression and classification.",
      "Identify the underlying principles, architectures, and learning algorithms of various types of neural networks.",
      "Select and design a suitable neural network for a given application.",
      "Implement deep neural networks that can efficiently run on computing machines."
    ],
    "semesters": [1, 2],
    "prerequisites": [["SC1004", "MH2802"], ["SC1007"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC4002",
    "au": 3,
    "title": "Natural Language Processing",
    "description": "This course introduces natural language processing at a basic level. 1. Basic concepts of syntax, semantics, and grammar formalisms 2. Basic techniques of language modelling, part-of-speech tagging, parsing, and semantic analysis 3. Well-known applications of natural language processing, such as machine translation and information extraction, and their evaluations",
    "intendedLearningOutcomes": [
      "Identify and analyse the linguistic characteristics of written English.",
      "Design and develop an NLP system to analyse and process a general corpus.",
      "Troubleshoot for domain-specific NLP applications."
    ],
    "semesters": [1],
    "prerequisites": [["SC2001", "MH1403"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC3010",
    "au": 3,
    "title": "Computer Security",
    "description": "This course aims to equip you with foundational knowledge on many important security issues and techniques required for cyber security. You will have the knowledge of different security policies and security models, and have the ability to recognise security features and discover pitfalls in computing systems, including the operating system and software.",
    "intendedLearningOutcomes": [
      "Understand security mechanisms in modern computer systems, its role, and its importance.",
      "Understand techniques for implementing security policies.",
      "Use and operate access-control mechanisms.",
      "Understand vulnerabilities associated with computer systems, and how they can be mitigated."
    ],
    "semesters": [1, 2],
    "prerequisites": [["SC2005"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4001",
    "au": 3,
    "title": "Security Management",
    "description": "This course aims to develop your ability to identify the problems associated with (cyber and information) security management and understand using case studies that to effectively address them, one needs to design solutions that encompass multiple dimensions, including technology, people, processes and (internal as well as external) regulations. This course provides an introductory but broad perspective of cyber and information security, and is relevant for anyone pursuing a career in the IT/ICT industry ? including those in product design and development, security engineering, penetration testing, network/system administration, as well as, given the proliferation of IT in all walks of our lives, in executive roles across industries and government.",
    "intendedLearningOutcomes": [
      "Explain the need for effective security management.",
      "Identify the typical problems associated with security management.",
      "Describe and debate the ways in which various organisations solve these problems.",
      "Analyse real world security incidents or problems, and propose and evaluate possible mitigations."
    ],
    "semesters": [1],
    "prerequisites": [["SC2006"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4014",
    "au": 3,
    "title": "Concepts and Techniques for Malware Analysis",
    "description": "Malware analysis is a specialization within cyber security. Malware attacks are often detrimental to companies or organizations. When malware breaches an organization's defences, the security team needs to act quickly to cure current infections and prevent it from re-occurring. Understanding the capabilities of the malware is critical to an organization's ability to quickly create a signature to prevent the widespread of the malware across the network, to block further communications from the attacker. This understanding could also be translated to valuable knowledge in identifying existing security gaps within an organization's system and fortify defences. This course aims to build a strong foundation to perform triage on malicious software using a variety of system and network monitoring utilities, a disassembler, a debugger and many other freely available tools.",
    "intendedLearningOutcomes": [
      "Set up a safe virtual environment to analyse malware.",
      "Determine and discuss the various capabilities of malware and its communication with attackers.",
      "Explain and apply techniques for malware analysis.",
      "Perform quick triage to extract indicators from malware."
    ],
    "semesters": [2],
    "prerequisites": [["SC1006", "SC2005"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4016",
    "au": 3,
    "title": "Cyber Threat Intelligence",
    "description": "This course aims to introduce Cyber Threat Intelligence as a concept and teach students the approach and different techniques for managing and processing Cyber Threat Intelligence ? from collections to prioritization of assets and to better leverage tactical, operational, and strategic-level threat intelligence as well as to better comprehend, synthesize, and leverage cyber threat intelligence to respond to different cyber situations.",
    "intendedLearningOutcomes": [
      "Discuss the concept of cyber threat intelligence and its application.",
      "Explain characteristics and motivations of cyber threat actors.",
      "Design cyber threat intelligence requirements and prioritise assets.",
      "Apply threat models and convert raw data into actionable intelligence."
    ],
    "semesters": [2],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "id": "CE/CZ4153",
    "courseCode": "SC4053",
    "au": 3,
    "title": "Blockchain Technology",
    "description": "Blockchain Technology has taken the world by storm with its proliferation in an astoundingly diverse array of applications. Cryptocurrencies and a plethora of business use-cases paved the way for inclusive decentralization through innovative incentives and smart contracts. In its modern incarnation, Blockchain offers the promise of immutability, consistency, attribution, authenticity and automation of record-keeping as well as computations within an inherently decentralized operating environment. This elective course in Computer Science and Engineering aims to introduce you to the core technical framework of Blockchain Technology and Cryptocurrencies, encompassing distributed systems, consensus protocols, incentive mechanisms and decentralized applications. You will also learn the major anonymity, security, privacy, scalability and interoperability issues in modern Blockchain, in addition to the relevant enterprise platforms, solutions, applications and regulatory aspects of the technology.",
    "intendedLearningOutcomes": [
      "Recognise and identify various consensus protocols in distributed systems.",
      "Discuss technical mechanisms and protocols of Bitcoin blockchain.",
      "Explain smart contracts, DApps, and tokens in Ethereum blockchain.",
      "Design and develop decentralised applications using tokens and smart contracts.",
      "Analyse anonymity, security, and privacy issues in modern blockchain.",
      "Analyse scalability and interoperability of current blockchain platforms.",
      "Examine enterprise solutions and applications of blockchain technology."
    ],
    "semesters": [2],
    "prerequisites": [["MH1812", "SC1007", "SC2001"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4060",
    "au": 3,
    "title": "Virtual and Augmented Reality",
    "description": "Definition of augmented and virtual reality; Human factors and sensory conflict; A generic VR system; 3D real-time computer graphics for VR systems; Physically-based simulation; Virtual reality hardware; Virtual reality software; Virtual reality applications; VRML and X3D; Shared virtual spaces. Each lecture module will be accompanied by typical examination problems and their model solutions which will be studied as hands-on experiences.",
    "intendedLearningOutcomes": [
      "Explain virtual and augmented reality concepts and their interaction with the real world.",
      "Identify typical issues in virtual and augmented reality.",
      "Describe real-world applications.",
      "Design and implement systems using learned concepts and mathematics."
    ],
    "semesters": [2],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4051",
    "au": 3,
    "title": "Distributed Systems",
    "description": "This course introduces the concepts and design of distributed systems. 1. Foundations: characteristics of distributed systems, architectural models, fundamental models, interprocess communication. 2. Middleware: remote method invocation, remote procedure call, name services, CORBA. 3. System Infrastructure: distributed file systems, peer-to-peer systems. 4. Distributed Algorithms: clock synchronization, logical and vector clocks, distributed mutual exclusion, election algorithms, consensus algorithms, replication and fault tolerance.",
    "intendedLearningOutcomes": [
      "Explain fundamental concepts of distributed systems.",
      "Describe distributed system architectures.",
      "Apply software components and services for distributed applications.",
      "Analyse and apply basic distributed algorithms.",
      "Apply design principles to distributed systems."
    ],
    "semesters": [2],
    "prerequisites": [["SC2005"], ["SC2008"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4054",
    "au": 3,
    "title": "Simulation and Modelling",
    "description": "Basic concepts: system, model, simulation. Different types of simulation: Monte Carlo simulation, continuous system simulation, discrete event simulation. Simulation software: modelling and simulation using Arena. Generating random numbers and random variables for simulation study: LCG, inverse transform, convolution. Analysis of input and output data: MLE, Goodness-of-fit test, confidence interval. Verification and validation: concepts and techniques. Queuing models: properties, performance measures and basic formulas. Comparison of alternative designs: paired-t approach, multiple comparison problem. Variance reduction: CRN, AV.",
    "intendedLearningOutcomes": [
      "Determine properties of physical systems for suitable simulations.",
      "Analyse real-world data and build simulation input models.",
      "Conduct simulation studies and analyse results.",
      "Conduct statistical analysis of simulation outputs.",
      "Analyse discrete event systems using simulation methods and mathematical modelling."
    ],
    "semesters": [2],
    "prerequisites": [["SC1007", "SC2000"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4021",
    "au": 3,
    "title": "Information Retrieval",
    "description": "This course aims to involve students in a technical way to understand and build information retrieval systems. They were expected to master the basic concepts and building blocks for information retrieval systems. In addition, applications in artificial intelligence were also introduced to get students acquainted with state of the arts.",
    "intendedLearningOutcomes": [
      "List and explain information retrieval system modules.",
      "Code preliminary search engines.",
      "Describe and distinguish retrieval systems.",
      "Apply clustering, classification, and web search techniques."
    ],
    "semesters": [2],
    "prerequisites": [["SC2001", "MH1403"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4003",
    "au": 3,
    "title": "Intelligent Agents",
    "description": "Introduction to Intelligent Agents; Deductive Reasoning Agents; Practical Reasoning Agents; Reactive and Hybrid Architectures; Introduction to Multi-Agent Systems and Applications; Working Together; Multi-Agent Interaction; Allocating Scarce Resources ? Auctions; Making Group Decisions; Forming Coalitions.",
    "intendedLearningOutcomes": [
      "Describe agent-based computation and its implications in AI and Computer Science.",
      "Identify problems associated with intelligent agents and multi-agent systems.",
      "Describe ways to solve problems related to intelligent agents and multi-agent systems.",
      "Analyse and propose solutions for real-world problems related to intelligent agents."
    ],
    "semesters": [2],
    "prerequisites": [["SC1007"], ["SC2000", "MH2500"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4052",
    "au": 3,
    "title": "Cloud Computing",
    "description": "Cloud computing refers to both the applications delivered as services over the Internet and the modern applications powered by these services, collectively known as Software as a Service (SaaS), IaaS (Infrastructure as a Service) and PaaS (Platform as a Service). This course introduces the students to the basic concepts and theory behind cloud computing. Techniques and algorithms in distributed computing that leverages artificial intelligence, machine learning and blockchains, topics that forms an integral part of modern cloud computing and edge/fog computing, will also be covered, along with industrial perspectives. Upon completion, students will be able to understand cloud computing applications that use software frameworks, e.g., MapReduce/Spark, distributed computing services-including database, networking, software, analytics, and intelligence over the Internet to offer faster innovation, flexible resources, and economies of scale.",
    "intendedLearningOutcomes": [
      "Describe the variety of connotations that agent-based computation implies and its role in Artificial Intelligence and Computer Science.",
      "Identify typical problems associated with intelligent agents and multi-agent systems.",
      "Describe and debate approaches to solving problems related to intelligent agents and multi-agent systems.",
      "Analyse real-world problems related to intelligent agents and multi-agent systems, and propose and evaluate mitigations."
    ],
    "semesters": [2],
    "prerequisites": [["SC1004", "MH2802"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4015",
    "au": 3,
    "title": "Cyber Physical System Security",
    "description": "Cyber physical systems are typically designed as a network of interacting elements with physical input and output, and are characterized by the interaction between the physical world (sensors, user inputs, actuators) and the cyber world (processing, decision making). Cyber physical systems are the driving force behind modern civilization, being integral part of technologies, such as additive manufacturing, smartcard-based payment, power delivery systems, drone-based operations, and smart home automation. Cyber physical systems are characterized by stringent performance requirements, such as, extremely low energy budget, small area footprint and often hard real-time constraints. Due to the pervasive nature of the cyber physical systems in our everyday lives, it also runs the risk of huge security hazards. In this course, we will learn about the basics of cyber physical systems, including the design principles and methodologies. Further, there will be a detailed treatment of the security challenges for cyber physical systems, which vary in practice due to the diverse nature of the application environment of cyber physical systems. These different forms of security breaches, observed across diverse cyber physical systems, will be put in a well-characterized taxonomy, to be systematically identified as attack surfaces. The techniques to handle these attacks will be described in a generic manner, including key management and wireless/RFID communication. The attack surfaces and protection/mitigation principles will then be elaborated with practical case studies, from the representative cyber physical systems such as automotive, smart card systems and smart grid.",
    "intendedLearningOutcomes": [
      "Describe the basic concepts of cryptography used in securing cyber-physical systems.",
      "Explain the design principles and architecture of cyber physical systems.",
      "Identify vulnerabilities in cyber physical systems through systematic analysis of attack surfaces.",
      "Discuss how security is integrated across different components and abstractions of cyber physical systems.",
      "Articulate principles for detecting and mitigating attacks on various attack surfaces of cyber-physical systems.",
      "Compare practical security implementations in cyber-physical systems like smart grids, smart vehicles, and smart card systems.",
      "Evaluate performance overheads associated with integrating security measures into cyber-physical systems."
    ],
    "semesters": [2],
    "prerequisites": [["SC1006"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4012",
    "au": 3,
    "title": "Software Security",
    "description": "This course aims to develop skills in software security. It focuses on security attacks launched by supplying specially crafted inputs to software components that modify the intended behaviours of those components, and the secure coding techniques (defences). The modified behaviours of the software components become security critical in a connected world where application systems are constructed from a collection of software components. Software developers who are not familiar with software security are likely to omit suitable defences out of ignorance. As such, this course will equip you with the deep knowledge about software security attack and defence techniques, a skill necessary to become IT security experts or professional software developers.",
    "intendedLearningOutcomes": [
      "Identify common causes of software vulnerabilities.",
      "Implement basic defences against software attacks.",
      "Utilize software security tools effectively.",
      "Explain the significance and phases of secure software development processes."
    ],
    "semesters": [2],
    "prerequisites": [["SC2002"], ["SC2005"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4023",
    "au": 3,
    "title": "Big Data Management",
    "description": "We are in the 'Big Data' era - an extremely large amount of data is created every day. The world of data management has dramatically changed in the 'Big Data' era. This is primarily driven by multiple factors including cheaper storage costs, increasing availability of sensors, smart devices, social software, and availability of cloud computing infrastructure, and cheaper processing cost of large volumes of data due to dramatic advances in modern hardware (e.g., solid state disk, multicore CPUs, large memory). This seismic impact of big data has led to increasing demand in building scalable data infrastructures toward supporting real-world applications. This course aims to provide a broad understanding of big data and current technologies in managing and processing them. Key topics covered in this course include big data 5V's, memory hierarchy and its relation to big data systems, distributed storage and computation of big data, as well as NoSQL key-value stores. Upon completion of this course, you will learn to evaluate issues associated with big data management, learn how the data is stored in a distributed system and how queries and analytics run in parallel, and understand the design philosophy of real-world key-value stores.",
    "intendedLearningOutcomes": [
      "Explain fundamental properties and operations of big data systems.",
      "Discuss the construction of big data systems using different storage and data models.",
      "Analyse advantages of various data systems in real-world applications.",
      "Describe data analytics procedures and techniques in big data applications.",
      "Design and implement big data processing using standard programming models and APIs."
    ],
    "semesters": [2],
    "prerequisites": [["SC2207"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC3102",
    "au": 3,
    "title": "Signals, Systems and Transforms",
    "description": "This course introduces the students to the basic concepts and theory behind techniques and algorithms used in signal processing systems, a topic that forms an integral part of engineering systems in many diverse areas. Emphasis is on different types of signals and systems, and their interrelation and representation using different orthogonal components. Upon completion, the student should be able to understand the fundaments of signals and linear time invariant (LTI) systems, understand and apply Fourier transforms, Laplace transforms, and Z-transform to the analysis and description of signals and LTI systems, and take advanced level courses on the systems area.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["SC1004"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC3103",
    "au": 3,
    "title": "Embedded Programming",
    "description": "This course aims to teach you how to develop programs for OS based embedded systems that are increasingly been used in many modern embedded systems, ranging from handphones to automotive applications. In this course, you will first learn about the process of developing multitasking programs for embedded systems based on RTOS, its features and its performance metric. You will then learn the programming techniques used in Linux based systems, ranging from the use of toolchain (GCC, Makefile and Linker Script), concurrent programming techniques (IPC, multitasking and multithreading), kernel modules development and its booting process.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["SC2107"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC2103",
    "au": 3,
    "title": "Digital Systems Design",
    "description": "This course aims to develop skills in digital hardware design to meet basic industry expectations. Here, the principles established in CE1005/CZ1005/SC1005-Digital Logic will be extended to encompass circuits of greater complexity. These circuits are no longer implemented using multiple discrete logic elements, as presented in CE1005/CZ1005/SC1005, but rather use Application Specific Gate Array (ASIC) or Field Programmable Gate Array (FPGA) technologies. Both of these technologies can accommodate circuits of complexity equivalent to many millions of gates. This course will focus on FPGA technology as it is gaining commercial popularity (due to the cost of ASIC Implementations). The necessary logic and connectivity for both technologies is synthesised by software tools from code written in a Hardware Description Language. As such, this course presents you with circuit design techniques for more advanced systems in a methodical manner based on modern design techniques.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["SC1005"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC2104",
    "au": 3,
    "title": "Sensors, Interfacing & Digital Control",
    "description": "The course aims to teach the students the operation principles of some common digital sensors used in today's control systems design and implementation. Students will also learn the interfacing techniques used to transfer data between the sensors and controller, and how the data can be processed by using appropriate digital signal processing algorithms. Student will then learn the basic operation principles of control systems, and how digital sensors are used in such systems to implement feedback control based on digital controller.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["SC1006"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC2107",
    "au": 3,
    "title": "Microprocessor System Design and Development",
    "description": "This core engineering course aims to develop your understanding of the architecture of a microprocessor system and the software development process of a microprocessor based embedded system. The course will expose you to various design and application considerations involved in developing the software and hardware. This includes power management, signal chain handling, memory interfacing and finite state machine design. All of which will be applied in the laboratory sessions using a microprocessor based robotic hardware as the platform.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["SC1006"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "SC4031",
    "au": 3,
    "title": "Internet of Things: Communications and Networking",
    "description": "The objective of this course is to introduce Internet of Things (IoT) technologies with the focus on data communications and networking. The course consists of two complementary components, i.e., wireless communications and wireless networking to support IoT applications and systems. The wireless communications part includes the basics and concepts of wireless transmission technologies such as frequency, power consumption, wireless performance, mobility, wireless standards, medium access control protocols including fixed assignment and random access techniques. The wireless networking part includes the introduction and basics of wireless ad hoc routing, and cellular networks such as cellular system architecture, frequency reuse concept, hexagon geometry, co-channel interference, capacity expansion techniques. In addition to these two major components, the course will also discuss the IoT network architecture, IoT devices and IoT application use cases to provide comprehensive understandings of the entire IoT ecosystem. After attending this course, the students will be able to address the various technical challenges associated with wireless communications and networking to support IoT applications by solving such challenges using the principles learned. In addition, the students will be able to design and evaluate wireless communications and networking systems to support specific IoT applications. The concepts covered in this course are particularly important for those working in fields such as IoT network development, wireless IoT apps implementations, and mobile IoT services.",
    "intendedLearningOutcomes": [
      "Design data communications and networking systems to support IoT applications.",
      "Analyse, evaluate, and assess performances of data communications and networking systems for IoT applications.",
      "Conduct performance optimization of data communications and networking systems for IoT applications.",
      "Review new technologies and conduct literature reviews related to IoT.",
      "Develop an IoT application using IoT technologies, and present a demo and project."
    ],
    "semesters": [2],
    "prerequisites": [["SC2008"]],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },

  {
    "courseCode": "MH1810",
    "au": 3,
    "title": "Mathematics I",
    "description": "In this course, the basic concepts of limits, differentiation and integration are introduced. Applications of differential and integral calculus are included. In addition, the course also covers topics on complex numbers, vectors and matrices to prepare the students for other courses in Year 1.",
    "intendedLearningOutcomes": [
      "Evaluate product, quotient, power, and roots of complex numbers.",
      "Use vector operators (dot product and cross product) to solve simple mechanics and geometry problems (e.g., find work done, moment, equations for planes, distance from a point to a plane, etc.).",
      "Evaluate matrix determinants and use Cramer’s rule to solve simultaneous equations.",
      "Evaluate limits by the substitution method, sandwich theorem, or L’Hopital’s rule.",
      "Use limits to determine if a function is continuous.",
      "Evaluate the derivatives of simple functions from the definition.",
      "Evaluate the derivatives of more complicated functions using rules of differentiation (e.g., product rule and chain rule).",
      "Use derivatives to establish linear approximations, estimate changes, and solve nonlinear equations (by Newton’s method).",
      "Use derivatives to assist in curve sketching and solving optimization problems.",
      "Evaluate integrals using integration formulas, rules of algebra, and substitution techniques.",
      "Evaluate more complicated integrals using integration by parts, trigonometric substitutions, partial fractions, reduction formulas, and special techniques for integrands involving quadratic or trigonometric expressions.",
      "Evaluate definite integrals using trapezium and Simpson’s rules and perform error analysis.",
      "Evaluate improper integrals of the first, second, and third kinds and test for convergence.",
      "Interpret the meaning of integration using the concept of Riemann sum.",
      "Use integration to find areas between curves (by dividing into vertical or horizontal strips) and volumes of solids (slicing and cylindrical shells methods).",
      "Use integration to find volumes of solids of revolution (slicing and cylindrical shells methods).",
      "Use integration to find lengths of plane curves and areas of surfaces of revolution.",
      "Use mean value theorem, fundamental theorem of calculus, and Leibniz’s rule to evaluate expressions involving differentiation and integration."
    ],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "School of Physical and Mathematical Sciences",
    "yearStanding": 0
  },
  {
    "courseCode": "MH1812",
    "au": 3,
    "title": "Discrete Mathematics",
    "description": "This course serves as an introduction to various topics in discrete mathematics. Familiarity with formal analysis through simple problems in some basic discrete structures is a key objective rather than knowing these structures in depth. Specifically, the main aim is to learn topics from the following broad areas of discrete mathematics: number theory, logic, combinatorics, and graph theory. This course aims to provide students with a solid mathematical foundation and is intended for first year computer science and computer engineering students.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "School of Physical and Mathematical Sciences",
    "yearStanding": 0
  },
  {
    "courseCode": "CC0003",
    "au": 2,
    "title": "Ethics & Civics in a Multicultural World",
    "description": "This course aims to equip students with the philosophical foundations necessary to understand theories of ethics and subsequently apply those theories to real-life scenarios and issues. It also aims to enable students to critically assess the civic institutions that structure their local and global communities. To these ends, the course will examine the nature of ethics, its understanding across different cultures, and how it is manifested in concepts, social structures, and governance institutions. Topics to be explored include human rights, democracy, freedom of speech, inequality, and sexuality. The rights and duties of citizenship shall be a unifying theme. Students will think through assumptions they hold on all of these matters. They will be provided with the tools to understand various and even contradictory perspectives on these important issues.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "",
    "yearStanding": 0
  },
  {
    "courseCode": "CC0005",
    "au": 3,
    "title": "Healthy Living & Wellbeing",
    "description": "This course is part of the NTU 2025 Education - Common Foundational & Interdisciplinary Collaborative Curriculum (ICC). It aims to provide multi-disciplinary competence in a cross-disciplinary, collaborative learning environment, with student interaction and collaboration across schools as a key learning foundation. As the title connotes, the main objective of this undergraduate course is to examine what constitutes living a good, healthy and flourishing life. According to research, individuals around the world pursue this 'flourishing life' in different ways, be it through improving one's physical fitness, seeking authentic relationships with others, or making a positive change in the environment. Thus, knowing and understanding how the different components of a 'good life' contribute to one's overall functioning is critical to one's healthy wellbeing. The latter, in turn, affords many benefits such as better health (physical, mental and emotional health) and stronger relationships. By the end of this course, you would have developed an awareness of what constitutes living a healthy and flourishing life, both of which indirectly contribute to a successful undergraduate education.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "",
    "yearStanding": 0
  },
  {
    "courseCode": "HW0001",
    "au": 0,
    "title": "Introduction to Academic Communication",
    "description": "The course aims to support you in your academic writing and reading skills across a wide range of disciplines. This course will provide opportunities for you to read current event articles widely and critically. As a result, you will learn to evaluate opinions and formulate well-substantiated arguments.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "otherPrerequisites": "For student who failed QET",
    "school": "",
    "yearStanding": 0
  },
  {
    "courseCode": "HW0002",
    "au": 0,
    "title": "Calculus",
    "description": "",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "otherPrerequisites": "For student not done Calculus",
    "school": "",
    "yearStanding": 0
  },
  {
    "courseCode": "EG1001",
    "au": 2,
    "title": "Engineers in Society",
    "description": "This course aims to provide a general understanding of the society we live in and the engineers' roles and responsibilities towards society's well-being. The course is part of broadening education objective in the engineering curriculum. The course covers a wide range of topics including the history of engineering, engineering ethics and practices, sustainability, and contributions by engineers towards society in the future. The students will have a holistic understanding of the role played by engineers and on their impact in society.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "College of Engineering",
    "yearStanding": 0
  },
  {
    "courseCode": "CC0001",
    "au": 2,
    "title": "Inquiry & Communication in an Interdisciplinary World",
    "description": "Researchers agree that writing is a tool for thinking (Menary, 2007; Klein & Boscolo, 2016; Miller and Jurecic, 2016; Reis, n.d.). As Reis explains, 'The bodily act of writing externalizes our thoughts, and the imposed structure (the written word) provides a vehicle by which those thoughts may be reorganized into new thinking, a new way of seeing the thoughts or a new way of organizing thoughts.' Miller and Jurecic similarly argue that 'writers discover what they think not before they write but in the act of writing' (2016, p. 60). One of the main aims of this course is to allow you to experience writing as a tool for thinking and to practice expressing ideas in formal writing and oral communication. While you will have the opportunity to understand and practice the genre conventions that are specific to your discipline later in your studies, this first common communication course is designed to help you form habits of mind that will serve you across the university and even in the world outside of the university. Taken by all first-year undergraduates, this foundational course will develop your written and oral communication skills, as well as your ability to read and analyze texts. It will help you to understand revision as integral to the process of composition, to convey your interpretations and ideas with confidence and clarity, and to consider audience and purpose when you communicate.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "",
    "yearStanding": 0
  },
  {
    "courseCode": "CC0002",
    "au": 2,
    "title": "Navigating the Digital World",
    "description": "With digitalization now becoming the new normal in our daily life, this course seeks to equip students from different disciplines with problem?solving techniques with the aid of computers and to enable them to acquire some common but essential digital skills that are crucial in today's workforce. In this course, students will learn how to apply the concept of computational thinking and quantitative reasoning to solve problems and analyze data. They will also learn how to identify online threats and understand the principles of ethics and intellectual property rights in the digital world. They will also be exposed to current issues in the digital world, which they can better understand through the logic of computational thinking and quantitative reasoning, such as cybersecurity and the rise of fake news. In addition, students will also learn how to use some of the latest online tools for effective presentation, communication, and collaborative skills in teams during the course.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "",
    "yearStanding": 0
  },
  {
    "courseCode": "CC0007",
    "au": 3,
    "title": "Science & Technology for Humanity",
    "description": "The course aims to inspire a long-lasting mindset of awareness, critical thinking, curiosity, and collaboration across disciplines through the lens of contemporary and near-future challenges for human communities in relation to scientific and technological innovations. Students will learn to perceive and analyze the potential benefits and costs of scientific/technological innovations and applications from different perspectives and on different scales. Students will then use these skills to identify real-life challenges and to propose solutions.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "",
    "yearStanding": 0
  },
  {
    "courseCode": "CC0006",
    "au": 3,
    "title": "Sustainability: Society, Economy & Environment",
    "description": "Sustainability stresses the importance of future development to meet the needs of the present without compromising the ability of future generations to meet their needs. This concept is a culmination of economic, environmental, and social discourse throughout the last few decades. The United Nations (UN) declared a Decade of Education for Sustainable Development (DESD) with the aim to promote ?a more sustainable world through different forms of education, training and public awareness activities?. This provides an opportunity to reconsider approaches undertaken to address global challenges. It is imperative that pedagogical directions for higher education institutions address the foundations of sustainable development across different disciplines due to its complex and multi-faceted nature that encompasses a full spectrum of socio-economic-environmental issues. As such, this course aims to stimulate critical thinking, curiosity, and the ability to structure and synthesise knowledge through the lens of sustainability. Learning will be reinforced by concrete case studies with a focus on topics such as resource management, pollution, responsible consumption, and climate change. The course will require systematic analyses of major current sustainability challenges from the perspectives of society, economy, and the environment, and look at how we can promote a more sustainable world through choices and actions, as individuals, societies, nations, and as a global community. Through this learning process, students will acquire a systems thinking approach to sustainability that enhances knowledge and skills sets relevant to various disciplines and career paths. This course hopes to inspire and equip students to be agents of change toward a more sustainable world.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "",
    "yearStanding": 0
  },
  {
    "courseCode": "ML0004",
    "au": 2,
    "title": "Career & Innovative Enterprise for the Future World",
    "description": "Having a creative and enterprising mindset can assist students in successfully manoeuvring through the VUCA world. It is crucial for students to nurture certain qualities associated with an enterprising mindset, including embracing uncertainty and change, honing critical thinking skills, and exhibiting a collaborative and adaptable nature. These qualities are vital in helping students to prepare for a rapidly evolving environment. The concept of designing your work life can be a valuable tool, inspiring students to explore their career options and possibilities by considering their values, interests, personality traits, and skills (VIPS) through prototype conversations. With more local employers emphasising skills-based hiring and retention, it is essential for students to continuously enhance their proficiency in relevant and sought-after skills to be well-prepared for the future of work.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "",
    "yearStanding": 0
  },

  {
    "courseCode": "SC2079",
    "au": 4,
    "title": "Multidisciplinary Design Project",
    "description": "Seminars and Workshops - Throughout the MDP, students will be required to attend relevant seminars and workshops that would help them understand the process and tools for designing, developing and marketing of real-world multidisciplinary products. These include both general and technical seminars. General seminars may cover topics such as guided innovation, multidisciplinary problem solving, working effectively in engineering teams, understanding effective marketing strategies, project management, professional, ethical and moral responsibilities etc. Technical seminars and workshops will be related to specific engineering methodology and tools that can help students implement their respective ideas. These may include systems engineering and design, large-scale web systems, embedded systems development tools, etc. In their implementation, students will have to factor in appropriate considerations for public health and safety, cultural, societal factors, environmental and other constraints as well as the needs for sustainable development. Laboratories - Laboratory during MDP will be a mixed of guided and open accessed sessions. Teams - Students will be grouped into teams of about 6-7 member. The composition of these team members will consist of a multidisciplinary mix of CS, CE and BCG students. Supervision - Each team will be assigned a faculty mentor during the MDP.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "HW0288",
    "au": 2,
    "title": "Engineering Communication",
    "description": "HW0288 is an advanced course which aims to enhance the spoken and written abilities of engineering students when communicating in both academic and professional settings. In this course, the emphasis is on advanced skills in academic and professional communication. In the academic literacy and information literacy components of the course, you learn advanced skills for searching academic databases, evaluating sources and incorporating and citing them appropriately in your writing. In the professional communication component of the course, you learn written and oral workplace communication skills such as writing emails, participating at meetings, interacting with clients and projecting a professional image of yourself.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["CC0001", "HW011", "HW0188"]],
    "school": "",
    "yearStanding": 3
  },
  {
    "courseCode": "SC3079",
    "au": 10,
    "title": "Professional Internship",
    "description": "",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC3920",
    "au": 10,
    "title": "Professional Internship",
    "description": "",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC3026",
    "au": 5,
    "title": "Professional Attachment",
    "description": "",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC3079",
    "au": 10,
    "title": "Professional Internship",
    "description": "",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 3
  },
  {
    "courseCode": "SC4079",
    "au": 4,
    "title": "Final Year Project (Part 1)",
    "description": "",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 4
  },
  {
    "courseCode": "SC4079_2",
    "au": 4,
    "title": "Final Year Project (Part 2)",
    "description": "",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "School of Computer Science and Engineering",
    "yearStanding": 4
  },

  {
    "courseCode": "MH1805",
    "au": 4,
    "title": "Calculus",
    "description": "This course aims to equip you with the subject knowledge, logical reasoning and analytical skills so that you are able to apply the concepts and techniques of calculus of one variable to solve problems encountered in science.",
    "intendedLearningOutcomes": [],
    "semesters": [1],
    "prerequisites": [],
    "school": "School of Physical and Mathematical Sciences",
    "yearStanding": 0
  },
  {
    "courseCode": "MH2802",
    "au": 4,
    "title": "Linear Algebra for Scientists",
    "description": "This course aims to support you in acquiring a wider range of mathematical concepts related to vector spaces and linear algebra, while also developing a strong set of mathematical skills for upper-level Physical and Computing Science courses. Through a mathematical approach to problem-solving, you will have the opportunity to develop thinking, reasoning, communication, and modelling skills. Additionally, the course aims to help you connect ideas within mathematics and apply mathematical principles in the context of Physical and Computing Science courses. Ultimately, this course seeks to provide an experience that fosters an appreciation for the rigour and abstraction in the discipline.",
    "intendedLearningOutcomes": [
      "perform simple vector operations (such as vector addition, subtraction and resolving a vector to its components in a given coordinate system) to solve related problems;",
      "perform scalar, vector products whenever appropriate to solve related problems (such as determining the projection of a vector on another and calculating the torque of a system of forces);",
      "perform scalar, vector triple products whenever appropriate to solve related problems;",
      "solve basic problems in analytical geometry using vectors (such as determining distances between point and a line / plane);",
      "recall and use the axioms of a linear space to determine if a given set forms a linear space;",
      "apply the idea of linear independence to determine whether a given set of vectors is dependent or independent;",
      "explain the idea of the space / subspace is spanned by a given set of (basis) vectors and determine if a set of (basis) vectors span a subspace;",
      "apply the concepts of norms and inner products to compute for a given pair of vectors and to test if a given pair of vectors are orthogonal;",
      "explain the concept of linear transformation, express a linear transformation as a matrix and compute the action of a linear transformation on a vector and a matrix (including the structures of rotation, reflection, scaling, stretching and shearing matrices);",
      "perform basic operations on matrices (including basic algebraic operations, matrix multiplication, computing of inverses, determinants and traces of matrices);",
      "solve systems of linear equations using techniques such as Gaussian elimination;",
      "compute the eigenvalues, eigenvectors of a given square matrix and determine the similarity transformation that diagonalizes the given square matrix;",
      "recall the definitions and use the properties of special matrices (such as Hermitian and unitary matrices);",
      "apply the techniques from ILO 1 – 13 to solve problems in Physical and Computing Science (such as analysing coupled oscillators and using Markov chains to solve problems)."
    ],
    "semesters": [1],
    "prerequisites": [],
    "otherPrerequisites": "H2 maths or equivalent",
    "school": "School of Physical and Mathematical Sciences",
    "yearStanding": 0
  },
  {
    "courseCode": "MH3500",
    "au": 4,
    "title": "Statistics",
    "description": "This course aims to develop your understanding of the statistical concepts of parameter estimation and hypothesis testing that are fundamental for real life applications of statistics as well as for numerous further courses in the curriculum of the statistics track.",
    "intendedLearningOutcomes": [],
    "semesters": [2],
    "prerequisites": [["MH2500"]],
    "school": "School of Physical and Mathematical Sciences",
    "yearStanding": 0
  },
  {
    "courseCode": "MH3511",
    "au": 3,
    "title": "Data Analysis with Computer",
    "description": "In today's business, data analysis plays an important role in making decisions more scientific and helping the business achieve effective operation. By closely examining data we can find patterns to perceive information, and the information can be used to enhance knowledge. This course provides basic concepts for data analysis with the usage of the R programming language. You will learn the skills of plotting, summarising, making inferences, and presenting various types of data.",
    "intendedLearningOutcomes": [],
    "semesters": [2],
    "prerequisites": [["MH2500", "BS1008"]],
    "school": "School of Physical and Mathematical Sciences",
    "yearStanding": 0
  },
  {
    "courseCode": "MH2100",
    "au": 4,
    "title": "Calculus III",
    "description": "Calculus III is a core Mathematics course that extends concepts and techniques developed in Calculus I and Calculus II to the case of functions of several real variables. In other words, we try to do the same things as in Calculus I and II, but in higher dimensions. In this course, we shall discuss the notions of limits, continuity, derivatives and integrals of real-valued and vector-valued functions of many variables. Most of the time, extending these familiar notions from one to several variables requires some degree of ingenuity, and we are going to have to spice up the material from Calculus I and II with a little bit of geometry and linear algebra. Techniques learned in Calculus III are essential for financial analysts, engineers, and for further study in mathematics.",
    "intendedLearningOutcomes": [],
    "semesters": [1],
    "prerequisites": [["MH1805", "MH1101", "MH1802"]],
    "school": "School of Physical and Mathematical Sciences",
    "yearStanding": 0
  },
  {
    "courseCode": "AB1003",
    "au": 5,
    "title": "Professional Attachment",
    "description": "",
    "intendedLearningOutcomes": [],
    "semesters": [],
    "prerequisites": [["CC0003"]],
    "school": "Nanyang Business School",
    "yearStanding": 0
  },
  {
    "courseCode": "AB1202",
    "au": 3,
    "title": "Statistics and Analysis",
    "description": "This course introduces the concepts and methods of statistical inferences: the process of inferring unknowns under uncertainty. Students of this course will also learn programming skills in the R environment for basic statistical analyses. This course consists of three main sections. Section 1 covers elements of probability models. Section 2 covers the basic theories in statistical inferences. Section 3 introduces the basic of two powerful and widely used analytic tools: regression and simulation analysis. Each weekly topic will be supplemented with relevant computer applications in the R environment.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "Nanyang Business School",
    "yearStanding": 0
  },
  {
    "courseCode": "AB1301",
    "au": 3,
    "title": "Business Law",
    "description": "This course aims to provide you with the necessary introductory accounting knowledge to understand how to use financial statement information to make economic decisions from a user perspective such as investors and creditors. In the process, you will learn to prepare a basic set of financial statements in accordance with the Singapore Financial Reporting Standards. The course also examines the impact of various accounting choices on the financial statements and the incentives that contracts based on accounting numbers can create for different stakeholders. This will help you understand why managers choose certain accounting methods and avoid others. This learning forms the foundation for further studies in areas which require accounting knowledge.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "Nanyang Business School",
    "yearStanding": 0
  },
  {
    "courseCode": "AD1102",
    "au": 3,
    "title": "Financial Accounting",
    "description": "This course aims to provide you with the necessary introductory accounting knowledge to understand how to use financial statement information to make economic decisions from a user perspective such as investors and creditors. In the process, you will learn to prepare a basic set of financial statements in accordance with the Singapore Financial Reporting Standards. The course also examines the impact of various accounting choices on the financial statements and the incentives that contracts based on accounting numbers can create for different stakeholders. This will help you understand why managers choose certain accounting methods and avoid others. This learning forms the foundation for further studies in areas which require accounting knowledge.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "Nanyang Business School",
    "yearStanding": 0
  },
  {
    "courseCode": "AB1601",
    "au": 3,
    "title": "Organisational Behaviour & Design",
    "description": "Business is in the midst of a revolutionary transformation. Emerging technologies that combine AI, machine learning, cutting-edge visualization techniques, and social robots are fast revolutionizing the business workplace globally. Building a motived workforce is a critical responsibility of managers. To do so, managers must know why people behave in organizations the way they do. Research in cognitive sciences, artificial intelligence and neuroscience has generated significant insights that can enrich our knowledge of people. This course is designed to focus on processes and methods that can improve the attitudes and behaviors of organizational members. You will learn to know more about yourself and others. You will also learn how to influence and predict your own behaviours as well as those of others. Within the context of a world of social media, AI, and machine learning, you will learn various organizational behaviour theories and concepts, and then apply them appropriately to real-life situations to make sense of human behaviours and human-robots interactions at work. This course adopts a flipped classroom approach, which will give you ample opportunity to share your knowledge with others and also learn with them collaboratively.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "Nanyang Business School",
    "yearStanding": 0
  },
  {
    "courseCode": "AB0602",
    "au": 4,
    "title": "Communication Management Strategies",
    "description": "The purpose of this course is to prepare you for the communication challenges that you are likely to meet in rapidly evolving global business environments. It will help you to present yourself confidently and professionally in the way you speak, write and participate in your chosen profession. AB0602 is designed to build on the communication theory, strategies and skills learnt in AB0601. Theory provides a conceptual framework that guides strategy and skills. Strategy allows communicators to make intelligent choices about content, organisation, style, tone, delivery, and timing of messages. Skills are needed to craft effective written documents, give constructive feedback, and create as well as deliver persuasive business presentations. In addition, this course also offers you the opportunity to acquire an understanding of the method of Principled Negotiation developed at the Harvard Negotiation Project. You will gain hands-on experience in negotiation through engagement in negotiation simulations.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["CC0001", "AB0601"]],
    "school": "Nanyang Business School",
    "yearStanding": 0
  },
  {
    "courseCode": "AB2008",
    "au": 1,
    "title": "Careers Future Forward",
    "description": "",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "Nanyang Business School",
    "yearStanding": 0
  },
  {
    "courseCode": "BC2402",
    "au": 4,
    "title": "Analytics II: Advanced Predictive Techniques",
    "description": "Previously, BC2406 introduced core concepts of Business Analytics and the important models in used by businesses and governments. However, there are more complex situations that require more sophisticated Analytics solutions. BC2407 is the continuation of BC2406. The main objective of BC2407 is to introduce students to advanced Analytics techniques to extract more useful and deeper insights under more complex realistic situations. At the end of the course, students will see the strengths and weaknesses of standard models, and learn advanced techniques to overcome the weaknesses in various scenarios. This course builds upon open source R software (as learnt in BC2406), and introduced a commercial software SAS, commonly used in Banks, Pharmaceuticals, MNCs and some government agencies. Students will learn the differences between R and SAS in both the model development phrase and in the standard software outputs.",
    "intendedLearningOutcomes": [],
    "semesters": [2],
    "prerequisites": [],
    "otherPrerequisites": "AB1202 & BC2406 OR BC2406 & CH2010 OR BC2406 & MH2814 OR BC2406 & MS4012 OR BC2406 & SC2000",
    "school": "Nanyang Business School",
    "yearStanding": 0
  },
  {
    "courseCode": "BC2406",
    "au": 4,
    "title": "Analytics I: Visual & Predictive Techniques",
    "description": "Most organizations are data rich and information poor. The large volumes of data in an organization are 'oilfields' rich in information content that are pending extraction with the right tools and models. Analytics involves the art of data exploration, visualization, communication and the science of analyzing large quantities of data in order to discover meaningful patterns and useful insights to support decision-making. The primary objective of this course is to introduce students to various techniques available to extract useful insights from the large volumes of data. At the end of the course, students will not only see the substantial opportunities that exist in real world, but also learn techniques that allow them to exploit these opportunities. This course focus on the use of open source R software, which is one of the key analytics software used in various industries and a critical skillset required in the job market for analytics and data science professionals.",
    "intendedLearningOutcomes": [],
    "semesters": [1],
    "prerequisites": [],
    "school": "Nanyang Business School",
    "yearStanding": 2
  },
  {
    "courseCode": "AB1201",
    "au": 3,
    "title": "Financial Management",
    "description": "d Income Securities, Derivatives Securities, and International Financial Management.This course aims to provide business and accounting students with a broad understanding of all the important financial principles, concepts, and analytical tools. This is a first course in finance and is compulsory for all business and accounting students. For students intending to major in banking and finance, this course is an important foundation course in order to better prepare themselves for other advanced courses such as Advanced Corporate Finance, Financial Markets and Institutions, International Financial Management, Investments, Equity Securities, Fixed Income Securities, and Derivatives Securities.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "Nanyang Business School",
    "yearStanding": 0
  },
  {
    "courseCode": "BC2407",
    "au": 3,
    "title": "Probability & Statistics for Computing",
    "description": "",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["MH1810"]],
    "school": "Nanyang Business School",
    "yearStanding": 0
  },
  {
    "courseCode": "AB1501",
    "au": 3,
    "title": "Marketing",
    "description": "This course aims to provide you with the opportunity to learn and the application of the basic principles of marketing in the Singapore market. A good understanding of marketing, by itself and in relation to other disciplines, is critical for anyone interested in developing successful and sustainable business enterprises. Hence, this course is a foundational course for marketing that is suitable for all students interested in business and accountancy. At the end of this course, you will be able to develop suitable customer-driven strategies to take advantage of potential market opportunities and manage the marketing process.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "Nanyang Business School",
    "yearStanding": 0
  },
  {
    "courseCode": "AD2102",
    "au": 3,
    "title": "Managerial Accounting",
    "description": "This course covers the strategic nature and relevance of managerial accounting for today's competitive business environment. The course adopts a unique user-perspective and emphasis is placed on the development of problem-solving and decision-making skills. Hence the course focuses on the use of essential managerial accounting tools and techniques to provide managerial accounting information for planning and control and to support effective economic decisions. The course also exposes students to real-life scenarios and gives students an opportunity to integrate theories to business practice. The course aims to equip students with analytical skills for problem solving and managerial skills for decision making. After the completion of this course, students should be equipped with a strong conceptual and technical knowledge in managerial accounting. Students should understand and appreciate how managerial accounting information support organizational planning and control, and day-to-day decision making.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["AD1102"]],
    "school": "Nanyang Business School",
    "yearStanding": 0
  },
  {
    "courseCode": "AB3602",
    "au": 3,
    "title": "Strategic Management",
    "description": "",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [["AB1501"], ["AB1601"]],
    "school": "",
    "yearStanding": 3
  },
  {
    "courseCode": "HE5091",
    "au": 3,
    "title": "Principles of Economics",
    "description": "Introduction. Demand and supply. Marginal reasoning and profit maximuzation. Market structure. Externality. Introduction to Macroeconomics. Keynesian Cross Model. Money, banking and financial Institutions. Aggregate demand and aggregate supply. Open economy. International trade.",
    "intendedLearningOutcomes": [],
    "semesters": [1, 2],
    "prerequisites": [],
    "school": "",
    "yearStanding": 0
  },
  {
    "courseCode": "BDE",
    "au": 3,
    "title": "Broadening and Deepening Elective",
    "description": "",
    "intendedLearningOutcomes": [],
    "semesters": [],
    "prerequisites": [],
    "otherPrerequisites": "Refer to Class Schedule",
    "school": "",
    "yearStanding": 0
  }
]
